import { defineStore } from 'pinia'

export const useContactUs = defineStore('ContactUs', {
   state: () => ({
      contactData:{
         address: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است',
         numbers: '02145454545 - 02145454454',
         seo: {
            title: 'تماس با ما',
            description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است',
         }
      }
   })
})