import { defineStore } from 'pinia'

export const useSingleProject = defineStore('singleProject', {
   state: () => ({
      singleProjectData:{
         mainImage:{
            image: 'Slider-test2.jpg',
         },
         tabContent:{
            description: 'گــــــروه ساختمــــانی H.H.B تحت مدیریت مهندس حجتی و مهندس بهزادپـور از سال 1386 فعالیت خود را در زمینه ساخت ساختمان های مسکونی، اداری  تجاری و ویلاسازی در تهران و حومه تهران تحت قالــــــب قراردادهـــــــای مدیریت پیمــــــــــــــان و پیمانکـــــــــــــاری آغـــــــــــــــــاز نمود. گروه ساختمانی HHB از سال 1391 اقدام به سرمایه گذاری طراحی و اجرای ساختمان های مسکونی در منطقه 2 تهران نمود و طی سالهای اخیر موفق به ساخت بالغ بر 100 واحـــــــد مسکونـــــــی شـــــــــده اســـــت. این گروه بواسطه همکاری با مهندسین مجرب در حوزه ساختمان در صدد ارتقاء سطح کیفی فضای مسکونی و فراهم ساختن محیطی مناسب سکونت به لحاظ معماری، آسایش و امنیت با بهره گیری از متد های روز صنعت ساختمان می باشد.',
            specifications: {
               name: 'البرز 9',
               location: 'منطقه 2 مرزداران',
               user: 'مسکونی',
               situation: 'تمام شده',
               constructionYear: '1400',
            },
            gallery: [
               'Slider-test1.jpg',
               'Slider-test3.jpg',
               'Slider-test4.jpg',
               'Slider-test2.jpg',
            ]
         }
      }
   })
})